#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ "crc32c_defs.h"
#ಅನ್ತರ್ಭಾವ <inttypes.h>

#ವ್ಯಾಖ್ಯಾನಿಸು ENTRIES_ಪ್ರತಿ_ಸಾಲು 4

#ಆದರೆ ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_LE_ಬಿಟ್ಟುಗಳು > 8
# define LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_LE_ಬಿಟ್ಟುಗಳು/8)
# define LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ 256
#ಇಲ್ಲದಿದ್ದರೆ
# define LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು 1
# define LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ (1 << ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_LE_ಬಿಟ್ಟುಗಳು)
#ಆದರೆ_ಅಂತ್ಯ

#ಆದರೆ ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_BE_ಬಿಟ್ಟುಗಳು > 8
# define BE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_BE_ಬಿಟ್ಟುಗಳು/8)
# define BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ 256
#ಇಲ್ಲದಿದ್ದರೆ
# define BE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು 1
# define BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ (1 << ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_BE_ಬಿಟ್ಟುಗಳು)
#ಆದರೆ_ಅಂತ್ಯ

ಸ್ಥಿರ uint32_t crc32table_be[BE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು][256];
ಸ್ಥಿರ uint32_t crc32ctable_le[LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು][256];

/**
 * crc32init_le() - allocate and initialize LE table data
 *
 * crc is the crc of the byte i; other entries are filled in based on the
 * fact that crctable[i^j] = crctable[i] ^ crctable[j].
 *
 */
ಸ್ಥಿರ ಶೂನ್ಯ crc32cinit_le(ಶೂನ್ಯ)
{
	ಚಿಹ್ನೆರಹಿತ i, j;
	uint32_t ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = 1;

	crc32ctable_le[0][0] = 0;

	ಗಾಗಿ (i = LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ >> 1; i; i >>= 1) {
		ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ >> 1) ^ ((ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ & 1) ? ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_32_C_POLY_LE : 0);
		ಗಾಗಿ (j = 0; j < LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ; j += 2 * i)
			crc32ctable_le[0][i + j] = ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ ^ crc32ctable_le[0][j];
	}
	ಗಾಗಿ (i = 0; i < LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ; i++) {
		ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = crc32ctable_le[0][i];
		ಗಾಗಿ (j = 1; j < LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು; j++) {
			ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = crc32ctable_le[0][ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ & 0xff] ^ (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ >> 8);
			crc32ctable_le[j][i] = ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ;
		}
	}
}

/**
 * crc32init_be() - allocate and initialize BE table data
 */
ಸ್ಥಿರ ಶೂನ್ಯ crc32init_be(ಶೂನ್ಯ)
{
	ಚಿಹ್ನೆರಹಿತ i, j;
	uint32_t ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = 0x80000000;

	crc32table_be[0][0] = 0;

	ಗಾಗಿ (i = 1; i < BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ; i <<= 1) {
		ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ << 1) ^ ((ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ & 0x80000000) ? CRCPOLY_BE : 0);
		ಗಾಗಿ (j = 0; j < i; j++)
			crc32table_be[0][i + j] = ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ ^ crc32table_be[0][j];
	}
	ಗಾಗಿ (i = 0; i < BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ; i++) {
		ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = crc32table_be[0][i];
		ಗಾಗಿ (j = 1; j < BE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು; j++) {
			ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ = crc32table_be[0][(ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ >> 24) & 0xff] ^ (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ << 8);
			crc32table_be[j][i] = ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ;
		}
	}
}

ಸ್ಥಿರ ಶೂನ್ಯ output_ಕೋಷ್ಟಕ(uint32_t (*ಕೋಷ್ಟಕ)[256], ಪೂರ್ಣಾಂಕ ಅಡ್ಡಸಾಲುಗಳು, ಪೂರ್ಣಾಂಕ len, ಅಕ್ಷರ *trans)
{
	ಪೂರ್ಣಾಂಕ i, j;

	ಗಾಗಿ (j = 0 ; j < ಅಡ್ಡಸಾಲುಗಳು; j++) {
		ಬರೆ("{");
		ಗಾಗಿ (i = 0; i < len - 1; i++) {
			ಆದರೆ (i % ENTRIES_ಪ್ರತಿ_ಸಾಲು == 0)
				ಬರೆ("\n");
			ಬರೆ("%s(0x%8.8xL), ", trans, ಕೋಷ್ಟಕ[j][i]);
		}
		ಬರೆ("%s(0x%8.8xL)},\n", trans, ಕೋಷ್ಟಕ[j][len - 1]);
	}
}

ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv)
{
	ಬರೆ("/* this file is generated - do not edit */\n\n");

	ಆದರೆ (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_BE_ಬಿಟ್ಟುಗಳು > 1) {
		crc32init_be();
		ಬರೆ("static const uint32_t "
		       "crc32table_be[%d][%d] = {",
		       BE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು, BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ);
		output_ಕೋಷ್ಟಕ(crc32table_be, LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು,
			     BE_ಕೋಷ್ಟಕ_ಗಾತ್ರ, "tobe");
		ಬರೆ("};\n");
	}
	ಆದರೆ (ಚಕ್ರೀಯ_ಪರೀಕ್ಷೆ_LE_ಬಿಟ್ಟುಗಳು > 1) {
		crc32cinit_le();
		ಬರೆ("static const uint32_t "
		       "crc32ctable_le[%d][%d] = {",
		       LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು, LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ);
		output_ಕೋಷ್ಟಕ(crc32ctable_le, LE_ಕೋಷ್ಟಕ_ಅಡ್ಡಸಾಲುಗಳು,
			     LE_ಕೋಷ್ಟಕ_ಗಾತ್ರ, "tole");
		ಬರೆ("};\n");
	}

	ಹಿಂತಿರುಗಿ 0;
}
