#అన్తర్భావ <stdio.h>
#అన్తర్భావ "crc32c_defs.h"
#అన్తర్భావ <inttypes.h>

#నిర్వచించు ENTRIES_చొప్పున_పంక్తి 4

#ఒకవేళ చక్రీయ_తనిఖీ_LE_బిట్లు > 8
# define LE_పట్టిక_అడ్డువరుసలు (చక్రీయ_తనిఖీ_LE_బిట్లు/8)
# define LE_పట్టిక_కొలత 256
#లేకపోతే
# define LE_పట్టిక_అడ్డువరుసలు 1
# define LE_పట్టిక_కొలత (1 << చక్రీయ_తనిఖీ_LE_బిట్లు)
#అయితే_ముగింపు

#ఒకవేళ చక్రీయ_తనిఖీ_BE_బిట్లు > 8
# define BE_పట్టిక_అడ్డువరుసలు (చక్రీయ_తనిఖీ_BE_బిట్లు/8)
# define BE_పట్టిక_కొలత 256
#లేకపోతే
# define BE_పట్టిక_అడ్డువరుసలు 1
# define BE_పట్టిక_కొలత (1 << చక్రీయ_తనిఖీ_BE_బిట్లు)
#అయితే_ముగింపు

స్థిర uint32_t crc32table_be[BE_పట్టిక_అడ్డువరుసలు][256];
స్థిర uint32_t crc32ctable_le[LE_పట్టిక_అడ్డువరుసలు][256];

/**
 * crc32init_le() - allocate and initialize LE table data
 *
 * crc is the crc of the byte i; other entries are filled in based on the
 * fact that crctable[i^j] = crctable[i] ^ crctable[j].
 *
 */
స్థిర శూన్య crc32cinit_le(శూన్య)
{
	గుర్తులేని i, j;
	uint32_t చక్రీయ_తనిఖీ = 1;

	crc32ctable_le[0][0] = 0;

	కొరకు (i = LE_పట్టిక_కొలత >> 1; i; i >>= 1) {
		చక్రీయ_తనిఖీ = (చక్రీయ_తనిఖీ >> 1) ^ ((చక్రీయ_తనిఖీ & 1) ? చక్రీయ_తనిఖీ_32_C_POLY_LE : 0);
		కొరకు (j = 0; j < LE_పట్టిక_కొలత; j += 2 * i)
			crc32ctable_le[0][i + j] = చక్రీయ_తనిఖీ ^ crc32ctable_le[0][j];
	}
	కొరకు (i = 0; i < LE_పట్టిక_కొలత; i++) {
		చక్రీయ_తనిఖీ = crc32ctable_le[0][i];
		కొరకు (j = 1; j < LE_పట్టిక_అడ్డువరుసలు; j++) {
			చక్రీయ_తనిఖీ = crc32ctable_le[0][చక్రీయ_తనిఖీ & 0xff] ^ (చక్రీయ_తనిఖీ >> 8);
			crc32ctable_le[j][i] = చక్రీయ_తనిఖీ;
		}
	}
}

/**
 * crc32init_be() - allocate and initialize BE table data
 */
స్థిర శూన్య crc32init_be(శూన్య)
{
	గుర్తులేని i, j;
	uint32_t చక్రీయ_తనిఖీ = 0x80000000;

	crc32table_be[0][0] = 0;

	కొరకు (i = 1; i < BE_పట్టిక_కొలత; i <<= 1) {
		చక్రీయ_తనిఖీ = (చక్రీయ_తనిఖీ << 1) ^ ((చక్రీయ_తనిఖీ & 0x80000000) ? CRCPOLY_BE : 0);
		కొరకు (j = 0; j < i; j++)
			crc32table_be[0][i + j] = చక్రీయ_తనిఖీ ^ crc32table_be[0][j];
	}
	కొరకు (i = 0; i < BE_పట్టిక_కొలత; i++) {
		చక్రీయ_తనిఖీ = crc32table_be[0][i];
		కొరకు (j = 1; j < BE_పట్టిక_అడ్డువరుసలు; j++) {
			చక్రీయ_తనిఖీ = crc32table_be[0][(చక్రీయ_తనిఖీ >> 24) & 0xff] ^ (చక్రీయ_తనిఖీ << 8);
			crc32table_be[j][i] = చక్రీయ_తనిఖీ;
		}
	}
}

స్థిర శూన్య output_పట్టిక(uint32_t (*పట్టిక)[256], పూర్ణాంకం అడ్డువరుసలు, పూర్ణాంకం len, అక్షరం *trans)
{
	పూర్ణాంకం i, j;

	కొరకు (j = 0 ; j < అడ్డువరుసలు; j++) {
		రాయి("{");
		కొరకు (i = 0; i < len - 1; i++) {
			ఒకవేళ (i % ENTRIES_చొప్పున_పంక్తి == 0)
				రాయి("\n");
			రాయి("%s(0x%8.8xL), ", trans, పట్టిక[j][i]);
		}
		రాయి("%s(0x%8.8xL)},\n", trans, పట్టిక[j][len - 1]);
	}
}

పూర్ణాంకం ప్రధాన(పూర్ణాంకం argc, అక్షరం **argv)
{
	రాయి("/* this file is generated - do not edit */\n\n");

	ఒకవేళ (చక్రీయ_తనిఖీ_BE_బిట్లు > 1) {
		crc32init_be();
		రాయి("static const uint32_t "
		       "crc32table_be[%d][%d] = {",
		       BE_పట్టిక_అడ్డువరుసలు, BE_పట్టిక_కొలత);
		output_పట్టిక(crc32table_be, LE_పట్టిక_అడ్డువరుసలు,
			     BE_పట్టిక_కొలత, "tobe");
		రాయి("};\n");
	}
	ఒకవేళ (చక్రీయ_తనిఖీ_LE_బిట్లు > 1) {
		crc32cinit_le();
		రాయి("static const uint32_t "
		       "crc32ctable_le[%d][%d] = {",
		       LE_పట్టిక_అడ్డువరుసలు, LE_పట్టిక_కొలత);
		output_పట్టిక(crc32ctable_le, LE_పట్టిక_అడ్డువరుసలు,
			     LE_పట్టిక_కొలత, "tole");
		రాయి("};\n");
	}

	తిరిగి 0;
}
